const acupointData = [
  {
    "病名": "头痛",
    "证型": "后枕(太阳)",
    "临床表现": "患者自觉头部疼痛。可伴高血压、偏头痛等。",
    "治疗原则": "疏调经脉，通络止痛",
    "主穴": "天柱、后顶、阿是穴、后溪、申脉",
    "配穴": ""
  },
  {
    "病名": "头痛",
    "证型": "侧头(少阳)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "疏调经脉，通络止痛",
    "主穴": "风池、太阳、率谷、阿是穴、外关、足临泣",
    "配穴": ""
  },
  {
    "病名": "头痛",
    "证型": "前额(阳明)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "疏调经脉，通络止痛",
    "主穴": "头维、印堂、阳白、阿是穴、合谷、内庭",
    "配穴": ""
  },
  {
    "病名": "头痛",
    "证型": "颠顶(厥阴)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "疏调经脉，通络止痛",
    "主穴": "百会、四神聪、阿是穴、内关、太冲",
    "配穴": ""
  },
  {
    "病名": "头痛",
    "证型": "全头",
    "临床表现": "患者自觉整个头部疼痛。",
    "治疗原则": "疏调经脉，通络止痛",
    "主穴": "印堂、太阳、百会、头维、天柱、风池、合谷、外关、内庭、足临泣",
    "配穴": ""
  },
  {
    "病名": "头痛",
    "证型": "外感风寒",
    "临床表现": "患者自觉头部疼痛，伴外感表证。",
    "治疗原则": "祛风通络，散邪止痛",
    "主穴": "按头痛部位分经选穴",
    "配穴": "风门、列缺"
  },
  {
    "病名": "头痛",
    "证型": "外感风热",
    "临床表现": "患者自觉头部疼痛，伴外感表证。",
    "治疗原则": "祛风通络，散邪止痛",
    "主穴": "按头痛部位分经选穴",
    "配穴": "大椎、曲池"
  },
  {
    "病名": "头痛",
    "证型": "外感风湿",
    "临床表现": "患者自觉头部疼痛，伴外感表证。",
    "治疗原则": "祛风通络，散邪止痛",
    "主穴": "按头痛部位分经选穴",
    "配穴": "偏历、阴陵泉"
  },
  {
    "病名": "头痛",
    "证型": "内伤(肝阳上亢)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "实：疏通经络，清利头窍；虚：疏通经络，滋养脑髓",
    "主穴": "按头痛部位分经选穴",
    "配穴": "太冲、太溪、侠溪、三阴交"
  },
  {
    "病名": "头痛",
    "证型": "内伤(痰浊上扰)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "实：疏通经络，清利头窍；虚：疏通经络，滋养脑髓",
    "主穴": "按头痛部位分经选穴",
    "配穴": "中脘、丰隆"
  },
  {
    "病名": "头痛",
    "证型": "内伤(瘀阻脑络)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "实：疏通经络，清利头窍；虚：疏通经络，滋养脑髓",
    "主穴": "按头痛部位分经选穴",
    "配穴": "血海、膈俞"
  },
  {
    "病名": "头痛",
    "证型": "内伤(气血亏虚)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "实：疏通经络，清利头窍；虚：疏通经络，滋养脑髓",
    "主穴": "按头痛部位分经选穴",
    "配穴": "气海、足三里"
  },
  {
    "病名": "头痛",
    "证型": "内伤(肾精不足)",
    "临床表现": "患者自觉头部疼痛。",
    "治疗原则": "实：疏通经络，清利头窍；虚：疏通经络，滋养脑髓",
    "主穴": "按头痛部位分经选穴",
    "配穴": "肾俞、太溪、三阴交"
  },
  {
    "病名": "紧张性头痛",
    "证型": "不分型",
    "临床表现": "颈部和头面部肌肉持续性收缩而产生的头部疼痛，伴压迫感、深重感，或紧箍感。",
    "治疗原则": "疏肝健脾，通络止痛",
    "主穴": "太阳、头维、百会、风池、颈夹脊、神门、足三里、太冲",
    "配穴": ""
  },
  {
    "病名": "偏头痛",
    "证型": "肝阳上亢",
    "临床表现": "一侧头部疼痛反复发作，伴恶心、呕吐、对光与声音过敏等。",
    "治疗原则": "疏泄肝胆，通经止痛",
    "主穴": "率谷、阿是穴、风池、外关、足临泣、太冲",
    "配穴": "百会、行间"
  },
  {
    "病名": "偏头痛",
    "证型": "痰湿偏盛",
    "临床表现": "一侧头部疼痛反复发作，伴恶心、呕吐、对光与声音过敏等。",
    "治疗原则": "疏泄肝胆，通经止痛",
    "主穴": "率谷、阿是穴、风池、外关、足临泣、太冲",
    "配穴": "丰隆、中脘"
  },
  {
    "病名": "偏头痛",
    "证型": "瘀血阻络",
    "临床表现": "一侧头部疼痛反复发作，伴恶心、呕吐、对光与声音过敏等。",
    "治疗原则": "疏泄肝胆，通经止痛",
    "主穴": "率谷、阿是穴、风池、外关、足临泣、太冲",
    "配穴": "血海、膈俞"
  },
  {
    "病名": "颈椎病",
    "证型": "肝肾亏虚",
    "临床表现": "颈、肩、上肢等痛，活动受限等。",
    "治疗原则": "活血通经",
    "主穴": "颈夹脊、天柱、风池、肩井、后溪、申脉、外关",
    "配穴": "肝俞、肾俞、太溪"
  },
  {
    "病名": "颈椎病",
    "证型": "风寒湿",
    "临床表现": "颈、肩、上肢等痛，活动受限等。",
    "治疗原则": "活血通经",
    "主穴": "颈夹脊、天柱、风池、肩井、后溪、申脉、外关",
    "配穴": "风府、风市、风门、大椎"
  },
  {
    "病名": "颈椎病",
    "证型": "风寒热",
    "临床表现": "颈、肩、上肢等痛，活动受限等。",
    "治疗原则": "活血通经",
    "主穴": "颈夹脊、天柱、风池、肩井、后溪、申脉、外关",
    "配穴": "大椎、曲池、荥穴、阴陵泉、丰隆"
  },
  {
    "病名": "肩关节周围炎",
    "证型": "风寒湿",
    "临床表现": "漏肩风：肩部长期固定疼痛，活动受限。",
    "治疗原则": "通经活血，祛风止痛",
    "主穴": "肩髃、肩髎、肩贞、肩前、阿是穴、曲池、阳陵泉",
    "配穴": "阴陵泉"
  },
  {
    "病名": "肩关节周围炎",
    "证型": "气血瘀滞",
    "临床表现": "漏肩风：肩部长期固定疼痛，活动受限。",
    "治疗原则": "通经活血，祛风止痛",
    "主穴": "肩髃、肩髎、肩贞、肩前、阿是穴、曲池、阳陵泉",
    "配穴": "内关、合谷、血海"
  },
  {
    "病名": "肩关节周围炎",
    "证型": "气血不足",
    "临床表现": "漏肩风：肩部长期固定疼痛，活动受限。",
    "治疗原则": "通经活血，祛风止痛",
    "主穴": "肩髃、肩髎、肩贞、肩前、阿是穴、曲池、阳陵泉",
    "配穴": "血海、气海、足三里、脾俞"
  },
  {
    "病名": "腰痛",
    "证型": "寒湿",
    "临床表现": "自觉腰部疼痛。",
    "治疗原则": "疏通经脉，通经止痛",
    "主穴": "肾俞、大肠俞、委中、阿是穴",
    "配穴": "腰阳关"
  },
  {
    "病名": "腰痛",
    "证型": "瘀血",
    "临床表现": "自觉腰部疼痛。",
    "治疗原则": "疏通经脉，通经止痛",
    "主穴": "肾俞、大肠俞、委中、阿是穴",
    "配穴": "血海、脾俞、膈俞"
  },
  {
    "病名": "腰痛",
    "证型": "肾虚",
    "临床表现": "自觉腰部疼痛。",
    "治疗原则": "疏通经脉，通经止痛",
    "主穴": "肾俞、大肠俞、委中、阿是穴",
    "配穴": "志室、太溪"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "行痹(风)",
    "临床表现": "膝关节疼痛，出伸不利，动则痛甚，休则痛缓，关节僵硬，局部肿胀/摩擦感等",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "膈俞、血海"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "痛痹(寒)",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "肾俞、腰阳关"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "着痹(湿)",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "足三里"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "热痹(热)",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "大椎、曲池"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "风寒湿痹",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "风门、合谷、风市、膈俞、血海"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "气滞血瘀",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "膈俞、血海、足三里"
  },
  {
    "病名": "退行性膝关节炎",
    "证型": "肝肾不足",
    "临床表现": "膝关节疼痛，出伸不利...",
    "治疗原则": "通经活络，行气止痛",
    "主穴": "阿是穴、犊鼻、内膝眼、阳陵泉、阴陵泉、足三里、血海、粱丘",
    "配穴": "肾俞、肝俞、太溪"
  },
  {
    "病名": "面瘫",
    "证型": "风寒",
    "临床表现": "口角向一侧歪斜、眼睑闭合不全；口眼歪斜",
    "治疗原则": "祛风通络，疏调经筋",
    "主穴": "阳白、颧髎、颊车、地仓、翳风、合谷",
    "配穴": "风池、列缺"
  },
  {
    "病名": "面瘫",
    "证型": "风热",
    "临床表现": "口角向一侧歪斜、眼睑闭合不全；口眼歪斜",
    "治疗原则": "祛风通络，疏调经筋",
    "主穴": "阳白、颧髎、颊车、地仓、翳风、合谷",
    "配穴": "外关、曲池"
  },
  {
    "病名": "面瘫",
    "证型": "气血不足",
    "临床表现": "口角向一侧歪斜、眼睑闭合不全；口眼歪斜",
    "治疗原则": "祛风通络，疏调经筋",
    "主穴": "阳白、颧髎、颊车、地仓、翳风、合谷",
    "配穴": "足三里、血海"
  },
  {
    "病名": "中风(中经络)",
    "证型": "肝阳上亢",
    "临床表现": "突然晕倒、半身不遂，肌肤不仁，口角歪斜，但没有神志迷蒙。",
    "治疗原则": "调神导气，疏通经络",
    "主穴": "水沟、内关、三阴交、极泉、尺泽、委中",
    "配穴": "太冲、太溪"
  },
  {
    "病名": "中风(中经络)",
    "证型": "痰热腑实",
    "临床表现": "突然晕倒、半身不遂...",
    "治疗原则": "调神导气，疏通经络",
    "主穴": "水沟、内关、三阴交、极泉、尺泽、委中",
    "配穴": "丰隆、风池"
  },
  {
    "病名": "中风(中经络)",
    "证型": "气虚血瘀",
    "临床表现": "突然晕倒、半身不遂...",
    "治疗原则": "调神导气，疏通经络",
    "主穴": "水沟、内关、三阴交、极泉、尺泽、委中",
    "配穴": "足三里、气海"
  },
  {
    "病名": "中风(中经络)",
    "证型": "阴虚风动",
    "临床表现": "突然晕倒、半身不遂...",
    "治疗原则": "调神导气，疏通经络",
    "主穴": "水沟、内关、三阴交、极泉、尺泽、委中",
    "配穴": "太溪、风池"
  },
  {
    "病名": "中风(中脏腑)",
    "证型": "闭证",
    "临床表现": "突然昏仆，神志恍惚，嗜睡/昏迷，伴有中经络的基础症状。",
    "治疗原则": "醒脑开窍，启闭固脱",
    "主穴": "水沟、百会、内关",
    "配穴": "十二井穴、合谷、太冲"
  },
  {
    "病名": "中风(中脏腑)",
    "证型": "脱证",
    "临床表现": "突然昏仆，神志恍惚，嗜睡/昏迷...",
    "治疗原则": "醒脑开窍，启闭固脱",
    "主穴": "水沟、百会、内关",
    "配穴": "关元、气海、神阙"
  },
  {
    "病名": "胃痛(实证)",
    "证型": "寒邪犯胃",
    "临床表现": "上腹胃脘部暴痛，痛势较剧，痛处拒按，饥时痛减，纳后痛增。",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "胃俞、神阙"
  },
  {
    "病名": "胃痛(实证)",
    "证型": "饮食伤胃",
    "临床表现": "上腹胃脘部暴痛，痛势较剧，痛处拒按...",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "丰隆、风池"
  },
  {
    "病名": "胃痛(实证)",
    "证型": "肝气犯胃",
    "临床表现": "上腹胃脘部暴痛，痛势较剧，痛处拒按...",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "足三里、气海"
  },
  {
    "病名": "胃痛(实证)",
    "证型": "气滞血瘀",
    "临床表现": "上腹胃脘部暴痛，痛势较剧，痛处拒按...",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "太溪、风池"
  },
  {
    "病名": "胃痛(虚证)",
    "证型": "脾胃虚寒",
    "临床表现": "上腹胃脘部疼痛隐隐，痛处喜按，空腹痛甚，纳后痛减。",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "太冲、太溪"
  },
  {
    "病名": "胃痛(虚证)",
    "证型": "胃阴不足",
    "临床表现": "上腹胃脘部疼痛隐隐，痛处喜按，空腹痛甚，纳后痛减。",
    "治疗原则": "和胃止痛",
    "主穴": "足三里、中脘、内关",
    "配穴": "丰隆、风池"
  },
  {
    "病名": "便秘",
    "证型": "热秘",
    "临床表现": "大便秘结不通，便质干燥、坚硬，排便周期或时间延长，常常数日一行，或虽有便意但排便不畅。",
    "治疗原则": "调理肠胃，行滞通便",
    "主穴": "大肠俞、天枢、上巨虚、支沟、足三里",
    "配穴": "合谷、内庭"
  },
  {
    "病名": "便秘",
    "证型": "气秘(气滞)",
    "临床表现": "大便秘结不通...",
    "治疗原则": "调理肠胃，行滞通便",
    "主穴": "大肠俞、天枢、上巨虚、支沟、足三里",
    "配穴": "中脘、太冲"
  },
  {
    "病名": "便秘",
    "证型": "气虚秘",
    "临床表现": "大便秘结不通...",
    "治疗原则": "调理肠胃，行滞通便",
    "主穴": "大肠俞、天枢、上巨虚、支沟、足三里",
    "配穴": "脾俞、气海"
  },
  {
    "病名": "便秘",
    "证型": "血虚秘",
    "临床表现": "大便秘结不通...",
    "治疗原则": "调理肠胃，行滞通便",
    "主穴": "大肠俞、天枢、上巨虚、支沟、足三里",
    "配穴": "脾俞、血海、三阴交"
  },
  {
    "病名": "便秘",
    "证型": "冷秘(阳虚)",
    "临床表现": "大便秘结不通...",
    "治疗原则": "调理肠胃，行滞通便",
    "主穴": "大肠俞、天枢、上巨虚、支沟、足三里",
    "配穴": "神阙、关元"
  },
  {
    "病名": "不寐",
    "证型": "肝火扰心",
    "临床表现": "经常不能获得正常睡眠，或入睡困难，或睡眠不深，或睡眠时间不足，严重者甚至彻夜不眠。",
    "治疗原则": "调和阴阳，安神利眠",
    "主穴": "百会、神门、申脉、照海、三阴交、安眠",
    "配穴": "太冲、太溪、行间、侠溪"
  },
  {
    "病名": "不寐",
    "证型": "心脾两虚",
    "临床表现": "入睡困难，或睡眠不深，彻夜不眠...",
    "治疗原则": "调和阴阳，安神利眠",
    "主穴": "百会、神门、申脉、照海、三阴交、安眠",
    "配穴": "心俞、脾俞、足三里"
  },
  {
    "病名": "不寐",
    "证型": "心肾不交",
    "临床表现": "入睡困难，或睡眠不深，彻夜不眠...",
    "治疗原则": "调和阴阳，安神利眠",
    "主穴": "百会、神门、申脉、照海、三阴交、安眠",
    "配穴": "心俞、肾俞、太溪"
  },
  {
    "病名": "不寐",
    "证型": "心胆气虚",
    "临床表现": "入睡困难，或睡眠不深，彻夜不眠...",
    "治疗原则": "调和阴阳，安神利眠",
    "主穴": "百会、神门、申脉、照海、三阴交、安眠",
    "配穴": "心俞、胆俞"
  },
  {
    "病名": "不寐",
    "证型": "脾胃不和",
    "临床表现": "入睡困难，或睡眠不深，彻夜不眠...",
    "治疗原则": "调和阴阳，安神利眠",
    "主穴": "百会、神门、申脉、照海、三阴交、安眠",
    "配穴": "丰隆、中脘、足三里"
  },
  {
    "病名": "痛经(实证)",
    "证型": "寒凝血瘀",
    "临床表现": "经期前/行经期小腹剧烈疼痛，痛处拒按。",
    "治疗原则": "行气活血，调经止痛",
    "主穴": "中极、三阴交、地机、次髎、十七椎",
    "配穴": "关元、归来"
  },
  {
    "病名": "痛经(实证)",
    "证型": "气滞血瘀",
    "临床表现": "经期前/行经期小腹剧烈疼痛，痛处拒按。",
    "治疗原则": "行气活血，调经止痛",
    "主穴": "中极、三阴交、地机、次髎、十七椎",
    "配穴": "太冲、血海"
  },
  {
    "病名": "痛经(虚证)",
    "证型": "肾气亏虚",
    "临床表现": "行经期/经后小腹或腰骶部绵绵隐痛，痛处喜按。",
    "治疗原则": "调补气血，温养冲任",
    "主穴": "关元、足三里、三阴交、次髎、十七椎",
    "配穴": "太溪、肾俞"
  },
  {
    "病名": "痛经(虚证)",
    "证型": "气血不足",
    "临床表现": "行经期/经后小腹或腰骶部绵绵隐痛，痛处喜按。",
    "治疗原则": "调补气血，温养冲任",
    "主穴": "关元、足三里、三阴交、次髎、十七椎",
    "配穴": "气海、脾俞"
  }
];
